darren1713/elua/src/platform/sim3u1xx/platform.c
// Platform-dependent functions

#include "platform.h"
#include "type.h"
#include "devman.h"
#include "genstd.h"
#include "stacks.h"
#include <reent.h>
#include <errno.h>
#include <string.h>
#include <ctype.h>
#include <stdio.h>
#include "utils.h"
#include "common.h"
#include "elua_adc.h"
#include "platform_conf.h"
#include "lrotable.h"
#include "buf.h"
#include "sermux.h"

// Platform includes
#include "sim3u1xx.h"
#include "sim3u1xx_Types.h"

// FreakUSB
#include "cdc.h"
#include "freakusb.h"
#include "hw.h"

// Generated code includes
#include <SI32_PBCFG_A_Type.h>
#include <SI32_PBSTD_A_Type.h>
#include <si32_device.h>
#include <SI32_RTC_A_Type.h>
#include <SI32_RSTSRC_A_Type.h>
#include <SI32_VREG_A_Type.h>
#include <SI32_PMU_A_Type.h>
#include <SI32_SARADC_A_Type.h>
#include "myPB.h"
#include <gVMON0.h>
#include <gLDO0.h>
#include <gVREG0.h>
#include <gRSTSRC0.h>

// ****************************************************************************
// Platform initialization

#define PIN_CHECK_INTERVAL 120
int wake_reason = WAKE_UNKNOWN;

// Watchdog timer
#define EARLY_WARNING_DELAY_MS        1000   // Will result in approx a 1 s
                                             // periodic early warning interrupt

#define RESET_DELAY_MS                2000  // Will result in approx a 2 s
                                            // reset delay (if early warning isn't captured)

#define EARLY_WARNING_THRESHOLD       (uint32_t)((16400*EARLY_WARNING_DELAY_MS)/1000)
#define RESET_THRESHOLD               (uint32_t)((16400*RESET_DELAY_MS)/1000)

#ifdef EXTRA_SLEEP_HOOK
extern void extras_sleep_hook( int seconds );
#endif

//I2C
#define I2C_TIMEOUT_SYSTICKS 3
static volatile int i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

#ifdef PCB_V7
#define PIN_HV_BANK SI32_PBSTD_3
#define PIN_HV_PIN ( 1 << 8 )
#else
#define PIN_HV_BANK SI32_PBSTD_3
#define PIN_HV_PIN ( 1 << 7 )
#endif

int rram_reg[RRAM_SIZE] __attribute__((section(".sret")));
static int rtc_remaining = 0;
static u8 sleep_delay = 0;

void sim3_pmu_reboot( void );
void sim3_pmu_reboot_nodfu( void );

extern int load_lua_function (char *func);

// forward dcls
static void pios_init();
static void clk_init();
static void rtc_init();
static void adcs_init();
static void gTIMER0_enter_auto_reload_config(void);
static void gTIMER1_enter_auto_reload_config(void);

static SI32_PBSTD_A_Type* const port_std[] = { SI32_PBSTD_0, SI32_PBSTD_1, SI32_PBSTD_2, SI32_PBSTD_3 };

void hard_fault_handler_c(unsigned int * hardfault_args)
{
  unsigned int stacked_r0;
  unsigned int stacked_r1;
  unsigned int stacked_r2;
  unsigned int stacked_r3;
  unsigned int stacked_r12;
  unsigned int stacked_lr;
  unsigned int stacked_pc;
  unsigned int stacked_psr;

  stacked_r0 = ((unsigned long) hardfault_args[0]);
  stacked_r1 = ((unsigned long) hardfault_args[1]);
  stacked_r2 = ((unsigned long) hardfault_args[2]);
  stacked_r3 = ((unsigned long) hardfault_args[3]);

  stacked_r12 = ((unsigned long) hardfault_args[4]);
  stacked_lr = ((unsigned long) hardfault_args[5]);
  stacked_pc = ((unsigned long) hardfault_args[6]);
  stacked_psr = ((unsigned long) hardfault_args[7]);

  printf ("[Hard fault handler]\n");
  printf ("R0 = %x\n", stacked_r0);
  printf ("R1 = %x\n", stacked_r1);
  printf ("R2 = %x\n", stacked_r2);
  printf ("R3 = %x\n", stacked_r3);
  printf ("R12 = %x\n", stacked_r12);
  printf ("LR = %x\n", stacked_lr);
  printf ("PC = %x\n", stacked_pc);
  printf ("PSR = %x\n", stacked_psr);
  printf ("BFAR = %x\n", (*((volatile unsigned  *)(0xE000ED38))));
  printf ("CFSR = %x\n", (*((volatile unsigned  *)(0xE000ED28))));
  printf ("HFSR = %x\n", (*((volatile unsigned  *)(0xE000ED2C))));
  printf ("DFSR = %x\n", (*((volatile unsigned  *)(0xE000ED30))));
  printf ("AFSR = %x\n", (*((volatile unsigned  *)(0xE000ED3C))));
  printf ("\n");
  printf ("\n");
  printf ("\n");

  sim3_pmu_reboot_nodfu();
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
void HardFault_Handler(void)
{
  asm(
  "tst lr, #4\n\t"
  "ite eq\n\t"
  "mrseq r0, msp\n\t"
  "mrsne r0, psp\n\t"
  "b hard_fault_handler_c"
  );
}

void WDTIMER0_IRQHandler(void)
{
    if ((SI32_WDTIMER_A_is_early_warning_interrupt_pending(SI32_WDTIMER_0) &
        SI32_WDTIMER_A_is_early_warning_interrupt_enabled(SI32_WDTIMER_0)))
    {
      SI32_WDTIMER_A_reset_counter(SI32_WDTIMER_0); 
      SI32_WDTIMER_A_clear_early_warning_interrupt(SI32_WDTIMER_0);
    }
}

#if defined( BUILD_USB_CDC )
unsigned console_cdc_active = 0;
#endif



// SiM3 SystemInit calls this function, disable watchdog timer
void mySystemInit(void)
{
  // Setup Watchdog Timer
  SI32_WDTIMER_A_stop_counter(SI32_WDTIMER_0);

  // enable APB clock to the Port Bank module
  SI32_CLKCTRL_A_enable_apb_to_modules_0 (SI32_CLKCTRL_0, SI32_CLKCTRL_A_APBCLKG0_PB0CEN_MASK);
  // make the SWO pin (PB1.3) push-pull to enable SWV printf
  //SI32_PBSTD_A_set_pins_push_pull_output (SI32_PBSTD_1, (1<<3));

}

#if defined( ELUA_BOARD_GSBRD )
int external_power()
{
  //check USB DC 3.9 or HVDC 3.8
  if( ( SI32_PBSTD_A_read_pins( PIN_HV_BANK ) & ( PIN_HV_PIN ) ) ||
      ( SI32_VREG_A_is_vbus_valid( SI32_VREG_0 ) ) )
    return 1;
  else
    return 0;
}
int external_buttons()
{
#ifdef PCB_V7
  //check inputs 1 and 2
  if( ( SI32_PBSTD_A_read_pins( SI32_PBSTD_2 ) & ( 1 << 2 ) ) ||
      ( SI32_PBSTD_A_read_pins( SI32_PBSTD_2 ) & ( 1 << 3 ) ) ||
      ( SI32_PBSTD_A_read_pins( SI32_PBSTD_2 ) & ( 1 << 4 ) ) )
    return 1;
  else
    return 0;
#else
  //check inputs 1 and 2
  if( /*( SI32_PBSTD_A_read_pins( SI32_PBSTD_3 ) & ( 1 << 6 ) ) ||*/
      ( SI32_PBSTD_A_read_pins( SI32_PBSTD_0 ) & ( 1 << 1 ) ) )
    return 1;
  else
    return 0;
#endif
}
int external_io()
{
#ifdef PCB_V7
  if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT1) == WAKE_ON_INPUT1_ACTIVE)
  {
    int val = SI32_PBSTD_A_read_pins( SI32_PBSTD_1 ) & ( 1 << 14 );
    if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT1_POLARITY) == WAKE_ON_INPUT1_POLARITY_POSITIVE)
    {
      if(val) return 1; 
    } else {
      if(!val) return 1;
    }
  }
  if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT2) == WAKE_ON_INPUT2_ACTIVE)
  {
    int val = SI32_PBSTD_A_read_pins( SI32_PBSTD_1 ) & ( 1 << 15 );
    if(rram_read_bit(RRAM_BIT_WAKE_ON_INPUT2_POLARITY) == WAKE_ON_INPUT2_POLARITY_POSITIVE)
    {
      if(val) return 1; 
    } else {
      if(!val) return 1;
    }
  }
#endif
  return 0;
}
#endif
static int pmu_wake_status = -1;
static int pmu_status = -1;
static int reset_status = -1;
void reset_parameters()
{
  int i;
  for(i=0;i<8;i++)
  {
    rram_write_int(i, 0);
  }
}


int platform_init()
{
  int i;
  SystemInit();

  // Configure the NVIC Preemption Priority Bits:
  // two (2) bits of preemption priority, six (6) bits of sub-priority.
  // Since the Number of Bits used for Priority Levels is five (5), so the
  // actual bit number of sub-priority is three (3)
  //NVIC_SetPriorityGrouping(0x05);

  // Setup peripherals
  // platform_setup_timers();
  SI32_VREG_A_enable_band_gap(SI32_VREG_0);
  SI32_VREG_A_exit_suspend_mode(SI32_VREG_0);

  // Peripheral Clocking setup
  clk_init();

