darren1713/elua/src/platform/sim3u1xx/platform.c
  //Set flash read speed to slow
  //SI32_FLASHCTRL_A_select_flash_read_time_slow(SI32_FLASHCTRL_0);

  SI32_PMU_A_clear_pmu_level_shifter_hold(SI32_PMU_0);
  pmu_status = SI32_PMU_0->STATUS.U32;
  pmu_wake_status = SI32_PMU_0->WAKESTATUS.U32;
  reset_status = SI32_RSTSRC_0->RESETFLAG.U32;
  SI32_PMU_A_clear_pin_level_shifter_hold(SI32_PMU_0);
  SI32_PMU_A_clear_wakeup_flags(SI32_PMU_0);
  SI32_PMU_A_clear_por_flag(SI32_PMU_0);

  // GPIO setup
  pios_init();

  // System timer setup
  cmn_systimer_set_base_freq( cmsis_get_cpu_frequency() );
  cmn_systimer_set_interrupt_freq( SYSTICKHZ );

  // Enable SysTick
  SysTick_Config( cmsis_get_cpu_frequency() / SYSTICKHZ );

  // RTC Configuration
  SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  rtc_remaining = (SI32_RTC_A_read_alarm0(SI32_RTC_0)-SI32_RTC_A_read_setcap(SI32_RTC_0))/16384;
  rtc_init();

#ifdef BUILD_ADC
  // Setup ADCs
  adcs_init();
#endif

#if defined( BUILD_USB_CDC )

  usb_init();
  hw_init();

  // init the class driver here
  cdc_init();

  // register the rx handler function with the cdc
  cdc_reg_rx_handler(NULL);
#endif //defined( BUILD_USB_CDC )

  // Common platform initialization code
  cmn_platform_init();

#if defined( ELUA_BOARD_GSBRD )

  //Determine if we had a power failure, voltage dropout, or reset button pressed
  //The pre-generated code for SI32_RSTSRC_A_get_last_reset_source is incorrect and does
  //not take into account PORRF. Also, these registers MUST be read in order PORRF, VMONRF, PINRF
  //as the remainder are invalid if the previous one is set. See table 6.2.
  if((pmu_status & SI32_PMU_A_STATUS_PM9EF_MASK) == SI32_PMU_A_STATUS_PM9EF_SET_U32)
  {
    //Check for reset pin while in PM9
    if((pmu_wake_status & SI32_PMU_A_WAKESTATUS_RSTWF_MASK) == SI32_PMU_A_WAKESTATUS_RSTWF_SET_U32)
    {
      reset_parameters();
      wake_reason = WAKE_RESETPIN;
    }
    else if((pmu_status & SI32_PMU_A_STATUS_PWAKEF_MASK) == (0 << SI32_PMU_A_STATUS_PWAKEF_SHIFT)) //Check for pin wake NOTE: SiLabs headers are wrong, this bit is backwards per the manual...
    {
      //Wakeup from WAKE pins, just reset reg[0] so we stay awake
      wake_reason = WAKE_WAKEPIN;

      //Put the remaining sleep time back into rram_reg[0]
      rram_write_int(RRAM_INT_SLEEPTIME, rram_read_int(RRAM_INT_SLEEPTIME) + rtc_remaining);

#ifdef EXTRA_SLEEP_HOOK
      //pass negative time to notify early wakeup
      //extras_sleep_hook(rtc_remaining * -1);
#endif

      //Don't auto-sleep for some period of seconds
      sleep_delay = 5;
    }
    else
    {
      if(rram_read_bit(RRAM_BIT_POWEROFF) == POWEROFF_MODE_ACTIVE)
      {
        rram_write_int(RRAM_INT_SLEEPTIME, SLEEP_FOREVER); //will wakeup in 68 years
      } 
      else if(rram_read_bit(RRAM_BIT_STORAGE_MODE) == STORAGE_MODE_ACTIVE)
      {
        //Sleep forever, in storage mode. Power button will wakeup device
        rram_write_int(RRAM_INT_SLEEPTIME, SLEEP_FOREVER); //will wakeup in 68 years
      } 

      if(external_buttons() || external_power() || external_io())
      {
        //Continue on as normal. The timer will count down rram_reg and execute
        //the appropriate script when it reaches zero
        wake_reason = WAKE_POWERCONNECTED;
      }
      else if( rram_read_int(RRAM_INT_SLEEPTIME) > 0 )  //Go back to sleep if we woke from a PMU wakeup
      {
        sim3_pmu_pm9( rram_read_int(RRAM_INT_SLEEPTIME) );
        wake_reason = WAKE_RTC;
      }
    }
  }
  else if (((reset_status & SI32_RSTSRC_A_RESETFLAG_PORRF_MASK) == SI32_RSTSRC_A_RESETFLAG_PORRF_SET_U32)
    ||  ((reset_status & SI32_RSTSRC_A_RESETFLAG_VMONRF_MASK) == SI32_RSTSRC_A_RESETFLAG_VMONRF_SET_U32)
    ||  ((reset_status & SI32_RSTSRC_A_RESETFLAG_PINRF_MASK) == SI32_RSTSRC_A_RESETFLAG_PINRF_SET_U32)
    ||  ((pmu_status & SI32_PMU_A_STATUS_PORF_MASK) == SI32_PMU_A_STATUS_PORF_SET_U32) 
    ||  ((pmu_wake_status & SI32_PMU_A_WAKESTATUS_RSTWF_MASK) == SI32_PMU_A_WAKESTATUS_RSTWF_SET_U32) )
  {
    //Fresh powerup! Reset our retained ram registers
    reset_parameters();
    wake_reason = WAKE_POWERUP;
  }

#endif
#if defined( INT_SYSINIT )
    cmn_int_handler( INT_SYSINIT, 0 );
#endif

  // Set the Systick as the highest priority, then uarts, then the rest
  NVIC_SetPriority(SysTick_IRQn, (1 << __NVIC_PRIO_BITS) - 1);
  for(i=WDTIMER0_IRQn;i<=VREG0LOW_IRQn;i++)
  {
    switch(i)
    {
      case UART0_IRQn:
      case UART1_IRQn:
      case USB0_IRQn:
      case USART0_IRQn:
      case USART1_IRQn:
        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 4);
        break;
      case TIMER1L_IRQn:
      case TIMER1H_IRQn:
        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 3);
        break;
      case TIMER0L_IRQn:
      case TIMER0H_IRQn:
        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 2);
        break;
      default:
        NVIC_SetPriority(i, (1 << __NVIC_PRIO_BITS) - 1);
        break;
    }
  }

  // Enable Timer 0
  gTIMER0_enter_auto_reload_config();
  // Enable Timer 1
  gTIMER1_enter_auto_reload_config();

  // Setup Watchdog Timer
  SI32_WDTIMER_A_stop_counter(SI32_WDTIMER_0);
  SI32_WDTIMER_A_reset_counter (SI32_WDTIMER_0);
  while(SI32_WDTIMER_A_is_threshold_update_pending(SI32_WDTIMER_0));
  SI32_WDTIMER_A_set_early_warning_threshold (SI32_WDTIMER_0, EARLY_WARNING_THRESHOLD);
  while(SI32_WDTIMER_A_is_threshold_update_pending(SI32_WDTIMER_0));
  SI32_WDTIMER_A_set_reset_threshold (SI32_WDTIMER_0, RESET_THRESHOLD);

#if 1 //Option to disable Watchdog Timer
  // Enable Watchdog Timer
  SI32_WDTIMER_A_start_counter(SI32_WDTIMER_0);

  /// Enable Watchdog Interrupt
  NVIC_ClearPendingIRQ(WDTIMER0_IRQn);
  SI32_WDTIMER_A_enable_early_warning_interrupt(SI32_WDTIMER_0);
  SI32_RSTSRC_A_enable_watchdog_timer_reset_source(SI32_RSTSRC_0);
  NVIC_EnableIRQ(WDTIMER0_IRQn);
#endif


  return PLATFORM_OK;
}

void clk_init( void )
{

  //SI32_CLKCTRL_A_select_ahb_divider(SI32_CLKCTRL_0, SI32_CLKCTRL_A_CONTROL_AHBDIV_DIV8_VALUE);

