darren1713/elua/src/platform/sim3u1xx/platform.c
  // Set system clock to AHB divider frequency
  //SystemCoreClock = 2500000;
#if defined( ELUA_BOARD_GSBRD )
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG0_PB0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_SPI0 |
                                         SI32_CLKCTRL_A_APBCLKG0_I2C0 |
                                         SI32_CLKCTRL_A_APBCLKG0_SARADC1 |
                                         SI32_CLKCTRL_A_APBCLKG0_AES0 |
                                         SI32_CLKCTRL_A_APBCLKG0_CRC0 |
                                         SI32_CLKCTRL_A_APBCLKG0_LPTIMER0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USB0 |
                                         SI32_CLKCTRL_A_APBCLKG0_FLASHCTRL0 |
                                         SI32_CLKCTRL_A_APBCLKG0_CMP0
                                         );
  SI32_CLKCTRL_A_enable_apb_to_modules_1(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG1_MISC1 |
                                         SI32_CLKCTRL_A_APBCLKG1_MISC0);
  //SI32_CLKCTRL_A_enable_ahb_to_emif(SI32_CLKCTRL_0);

#else
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG0_PB0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_USART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART0 |
                                         SI32_CLKCTRL_A_APBCLKG0_UART1 |
                                         SI32_CLKCTRL_A_APBCLKG0_CMP0);
  SI32_CLKCTRL_A_enable_apb_to_modules_1(SI32_CLKCTRL_0,
                                         SI32_CLKCTRL_A_APBCLKG1_MISC1 |
                                         SI32_CLKCTRL_A_APBCLKG1_MISC0);
#endif
}
void RTC0ALRM_IRQHandler()
{
  if (SI32_RTC_A_is_alarm0_interrupt_pending(SI32_RTC_0))
  {
    SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);
    //printf("Alarm\n");
  }
}

void rtc_init( void )
{
  SI32_RTC_A_enable_high_speed_mode(SI32_RTC_0);
  // Low Frequency Oscillator Mode
  SI32_RTC_A_enable_low_frequency_oscillator(SI32_RTC_0);
  SI32_RTC_A_set_clock_source_lfo(SI32_RTC_0);
  SI32_RTC_A_disable_crystal_oscillator(SI32_RTC_0);

  SI32_RTC_A_enable_module(SI32_RTC_0);

  SI32_RTC_A_start_timer(SI32_RTC_0);
  SI32_RTC_A_enable_alarm0_auto_reset(SI32_RTC_0);
  SI32_RTC_A_write_alarm0(SI32_RTC_0, 0xF000);
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);

  SI32_RTC_A_enable_alarm0_interrupt(SI32_RTC_0);

  NVIC_ClearPendingIRQ(RTC0ALRM_IRQn);
  NVIC_EnableIRQ(RTC0ALRM_IRQn);
}

extern u32 SystemCoreClock;
u32 cmsis_get_cpu_frequency()
{
  return SystemCoreClock;
}
static u8 firstSecond = 1;
static u8 tickSeconds = 0;

void SecondsTick_Handler()
{
  //Check if we are supposed to be sleeping
  if(rram_read_int(RRAM_INT_SLEEPTIME) > 0)
  {
    //Don't count down timer if buttons are depressed
    if(rram_read_int(RRAM_INT_SLEEPTIME) != SLEEP_FOREVER)
    {
      if(rram_read_int(RRAM_INT_SLEEPTIME) != 1 || ( !external_buttons() && ok_to_sleep() == OKTOSLEEP ) )
        rram_write_int(RRAM_INT_SLEEPTIME, rram_read_int(RRAM_INT_SLEEPTIME)-1);
    }

    if(rram_read_int(RRAM_INT_SLEEPTIME) == 0)
    {
      //Our timer has expired and we are still powered, start TX script
      //Do a software reboot UNTIL we get the memory leaks sorted out...
      //sim3_pmu_reboot();
#ifdef REBOOT_AT_END_OF_SLEEP
      sim3_pmu_reboot_nodfu();
#endif
      //Normally we would run the startup script, but fix memory leaks first...
      //printf("startup %i\n", load_lua_function("autorun"));
      printf("wakeup\n");
      cmn_int_handler( INT_BOOT, 0 );
      //printf("wakeup %i\n", load_lua_string("wakeup();\n"));
    }
    if((external_power() == 0 && !external_buttons()) || rram_read_bit(RRAM_BIT_SLEEP_WHEN_POWERED) == SLEEP_WHEN_POWERED_ACTIVE)
    {
      printf("no power %i\n", rram_read_int(RRAM_INT_SLEEPTIME));
      if(sleep_delay > 0)
        sleep_delay--;
      else
        sim3_pmu_pm9( rram_read_int(RRAM_INT_SLEEPTIME) );
    }
    //else if(rram_read_int(RRAM_INT_SLEEPTIME) != SLEEP_FOREVER && 
    //  ( ( ( rram_read_int(RRAM_INT_SLEEPTIME) % 300 ) == 0 ) || rram_read_int(RRAM_INT_SLEEPTIME) < 5 ) )
    //  printf("powered %i\n", rram_read_int(RRAM_INT_SLEEPTIME));
  }
  if(firstSecond)
  {
    SI32_RTC_A_start_timer_capture(SI32_RTC_0);
    while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

    printf("PWS 0x%x PS 0x%x RS 0x%x - %i rtc %i\n",
         pmu_wake_status,
         pmu_status,
         reset_status,
         wake_reason,
         rtc_remaining  );
    firstSecond = 0;
  }
}

static u8 seconds_tick_pending = 0;
void TIMER0H_IRQHandler(void)
{ 
#if defined( BUILD_USB_CDC )
  //Check if USB is powered. It will not actually TX/RX unless enumerated though
  if( SI32_VREG_A_is_vbus_valid( SI32_VREG_0 ) )
    console_cdc_active = 1;
  else
    console_cdc_active = 0;

  if( console_cdc_active )
    usb_poll();
#endif

#if defined( INT_SYSTICK )
  cmn_int_handler( INT_SYSTICK, 0 );
#endif

  if(seconds_tick_pending)
  {
    SecondsTick_Handler();
    seconds_tick_pending = 0;
  }

  // Clear the interrupt flag
  SI32_TIMER_A_clear_high_overflow_interrupt(SI32_TIMER_0);
}

//NOTE! These must be sized by a factor of 2 to calculate properly
//First byte is size of the array
#define LED_COUNT 5
#define LED_MAX_ARRAY 32

static u8 CLED_FADEUP[] = { LED_MAX_ARRAY/2, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0 };
static u8 CLED_FADEDOWN[] = { LED_MAX_ARRAY/2, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 };
static u8 CLED_OFF[] = { 1, 15 };
static u8 CLED_ON[] = { 1, 0 };
static u8 CLED_FASTFLASH[] = { LED_MAX_ARRAY/4, 0, 15, 15, 15, 15, 15, 15, 15 };
static u8 CLED_MEDIUMFLASH[] = { LED_MAX_ARRAY/2, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15 };
static u8 CLED_SLOWFLASH[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 CLED_FLASH1[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 CLED_FLASH2[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 CLED_FLASH3[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 CLED_FLASH4[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};
static u8 CLED_FLASH5[] = { LED_MAX_ARRAY, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15};

static u8 * led_cled_ptr[] = {
  CLED_FADEUP,
  CLED_FADEDOWN,
  CLED_OFF,
  CLED_ON,
  CLED_FASTFLASH,
  CLED_MEDIUMFLASH,
  CLED_SLOWFLASH,
  CLED_FLASH1,
  CLED_FLASH2,
  CLED_FLASH3,
  CLED_FLASH4,
  CLED_FLASH5
};

#define LEDTICKHZ 1250
u8 led_pointer_tick = 0;
u8 led_tick = 0;
u8 led_repeat_tick = 0;

u8 led_ticks = 0;

