darren1713/elua/src/platform/sim3u1xx/platform.c
u8 led_ticks_ptr[LED_COUNT] = { 0, 0, 0, 0, 0 };


#define LED_REPEATS_FOREVER 255

//u8 * led_mode_ptr[] = { CLED_FADEDOWN, CLED_FADEUP, CLED_FASTFLASH, CLED_SLOWFLASH, CLED_MEDIUMFLASH };
//u8 led_repeats_ptr[LED_COUNT] = { 10, 10, 10, 10, 10 };

u8 * led_mode_ptr[] = { CLED_OFF, CLED_OFF, CLED_OFF, CLED_OFF, CLED_OFF };
u8 led_repeats_ptr[LED_COUNT] = { 10, 10, 10, 10, 10 };

//Pending variables here...wait for new "frame"
u8 * led_pending_mode_ptr[LED_COUNT] = { NULL, NULL, NULL, NULL, NULL };
u8 led_pending_repeats_ptr[LED_COUNT] = { 0, 0, 0, 0, 0 };

void TIMER1H_IRQHandler(void)
{ 
  led_ticks=((led_ticks+1) & 0x0F);
  if(!led_ticks)
  {
    //turn LED's off. 5 LEDS are on P2 and the on board blue LED is on P4.3
    SI32_PBSTD_A_write_pins_low( port_std[ 2 ], 
        ( ( u32 ) 1 << 5 ) |
        ( ( u32 ) 1 << 6 ) |
        ( ( u32 ) 1 << 7 ) |
        ( ( u32 ) 1 << 8 ) |
        ( ( u32 ) 1 << 9 )
         );
    SI32_PBHD_A_write_pins_low( SI32_PBHD_4, ( ( u32 ) 1 << 3 ) );

    if(led_pointer_tick == 3)
    {
      led_pointer_tick = 0;

      //load next values here
      if(led_repeat_tick == 0)
      {
        led_repeat_tick = 0;

        int lednum;
        for(lednum=0;lednum<LED_COUNT;lednum++)
        {
          if(led_pending_mode_ptr[lednum] != NULL)
          {
            led_mode_ptr[lednum] = led_pending_mode_ptr[lednum];
            led_repeats_ptr[lednum] = led_pending_repeats_ptr[lednum];
            led_pending_mode_ptr[lednum] = NULL;
            led_pending_repeats_ptr[lednum] = 0;
          }
        }
      }

      int lednum;
      for(lednum=0;lednum<LED_COUNT;lednum++)
      {
        if(led_repeats_ptr[lednum] > 0)
        {
          if((led_repeats_ptr[lednum] != LED_REPEATS_FOREVER) && ((led_tick % led_mode_ptr[lednum][0]) == 0))
            led_repeats_ptr[lednum]--;
          if(led_repeats_ptr[lednum] > 0)
            led_ticks_ptr[lednum] = led_mode_ptr[lednum][(led_tick % led_mode_ptr[lednum][0])+1];
        }
      }
      led_tick++;
      led_repeat_tick = (led_repeat_tick+1) % LED_MAX_ARRAY;
    }
    led_pointer_tick++;
  }

  if(led_ticks > led_ticks_ptr[0])
    SI32_PBSTD_A_write_pins_high( port_std[ 2 ], ( ( u32 ) 1 << 5 ) );
  if(led_ticks > led_ticks_ptr[1]) //Power led. Tie external and onboard power LED's togethere
  {
    SI32_PBSTD_A_write_pins_high( port_std[ 2 ], ( ( u32 ) 1 << 6 ) );
    SI32_PBHD_A_write_pins_high( SI32_PBHD_4, ( ( u32 ) 1 << 3 ) );
  }
  if(led_ticks > led_ticks_ptr[2])
    SI32_PBSTD_A_write_pins_high( port_std[ 2 ], ( ( u32 ) 1 << 7 ) );
  if(led_ticks > led_ticks_ptr[3])
    SI32_PBSTD_A_write_pins_high( port_std[ 2 ], ( ( u32 ) 1 << 8 ) );
  if(led_ticks > led_ticks_ptr[4])
    SI32_PBSTD_A_write_pins_high( port_std[ 2 ], ( ( u32 ) 1 << 9 ) );
 
  // Clear the interrupt flag
  SI32_TIMER_A_clear_high_overflow_interrupt(SI32_TIMER_1);
}

void led_set_mode(int led, int mode, int cycles)
{
  if(led > LED_COUNT)
    return;
  if(cycles > 255)
    cycles = 255;
  led_pending_mode_ptr[led] = led_cled_ptr[mode];
  led_pending_repeats_ptr[led] = cycles;
}

int led_get_mode(int led)
{
  if(led > LED_COUNT)
    return -1;

  int i;
  if(led_pending_mode_ptr[led] != NULL)
  {
    for(i=0;i<sizeof(led_cled_ptr);i++)
    {
      if(led_pending_mode_ptr[led] == led_cled_ptr[i])
        return i;
    }
  } else {
    for(i=0;i<sizeof(led_cled_ptr);i++)
    {
      if(led_mode_ptr[led] == led_cled_ptr[i])
        return i;
    }    
  }
  return -1;
}

// SysTick interrupt handler
void SysTick_Handler()
{
  // Handle virtual timers
  cmn_virtual_timer_cb();

  // Handle system timer call
  cmn_systimer_periodic();

  tickSeconds++;
  if(tickSeconds == SYSTICKHZ)
  {
    seconds_tick_pending = 1;
    tickSeconds = 0;
  }
  if(i2c_timeout_timer)
    i2c_timeout_timer--;
}

static void gTIMER0_enter_auto_reload_config(void)
{
  // ENABLE TIMER0 CLOCK
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
    SI32_CLKCTRL_A_APBCLKG0_TIMER0CEN_ENABLED_U32);

  // INITIALIZE TIMER  
  SI32_TIMER_A_initialize (SI32_TIMER_0, 0x00, 0x00, 0x00, 0x00);
  SI32_TIMER_A_select_single_timer_mode (SI32_TIMER_0);
  SI32_TIMER_A_select_high_clock_source_apb_clock (SI32_TIMER_0);
  SI32_TIMER_A_select_high_auto_reload_mode (SI32_TIMER_0);

  // Set overflow frequency to SYSTICKHZ
  SI32_TIMER_A_write_capture (SI32_TIMER_0, (unsigned) -(cmsis_get_cpu_frequency()/SYSTICKHZ));
  SI32_TIMER_A_write_count (SI32_TIMER_0, (unsigned) -(cmsis_get_cpu_frequency()/SYSTICKHZ));  

  // Run Timer
  SI32_TIMER_A_start_high_timer(SI32_TIMER_0);

  // ENABLE INTERRUPTS
  NVIC_ClearPendingIRQ(TIMER0H_IRQn);
  NVIC_EnableIRQ(TIMER0H_IRQn);
  SI32_TIMER_A_enable_high_overflow_interrupt(SI32_TIMER_0);
}

static void gTIMER1_enter_auto_reload_config(void)
{
  // ENABLE TIMER1 CLOCK
  SI32_CLKCTRL_A_enable_apb_to_modules_0(SI32_CLKCTRL_0,
    SI32_CLKCTRL_A_APBCLKG0_TIMER1CEN_ENABLED_U32);

  // INITIALIZE TIMER  
  SI32_TIMER_A_initialize (SI32_TIMER_1, 0x00, 0x00, 0x00, 0x00);
  SI32_TIMER_A_select_single_timer_mode (SI32_TIMER_1);
  SI32_TIMER_A_select_high_clock_source_apb_clock (SI32_TIMER_1);
  SI32_TIMER_A_select_high_auto_reload_mode (SI32_TIMER_1);

  // Set overflow frequency to SYSTICKHZ
  SI32_TIMER_A_write_capture (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/LEDTICKHZ));
  SI32_TIMER_A_write_count (SI32_TIMER_1, (unsigned) -(cmsis_get_cpu_frequency()/LEDTICKHZ));  

  // Run Timer
  SI32_TIMER_A_start_high_timer(SI32_TIMER_1);

  // ENABLE INTERRUPTS
  NVIC_ClearPendingIRQ(TIMER1H_IRQn);
  NVIC_EnableIRQ(TIMER1H_IRQn);
  SI32_TIMER_A_enable_high_overflow_interrupt(SI32_TIMER_1);
}

// ****************************************************************************
// PIO section


void pios_init( void )
{
#if defined( ELUA_BOARD_GSBRD )
  // SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);

  // // PB0 Setup
  // SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0603);
  // SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, 0x1114);
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x37FB);

