darren1713/elua/src/platform/sim3u1xx/platform.c
  // // PB1 Setup
  // SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_1, 0x00A1);
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0xFC1C);

  // // Enable Crossbar0 signals & set properties
  // SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0,
  //                                        SI32_PBCFG_A_XBAR0H_UART0EN |
  //                                        SI32_PBCFG_A_XBAR0H_UART1EN);
  // SI32_PBCFG_A_enable_xbar0l_peripherals(SI32_PBCFG_0,
  //                                        SI32_PBCFG_A_XBAR0L_USART0EN |
  //                                        SI32_PBCFG_A_XBAR0L_I2C0EN);
  // SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);

  // // PB2 Setup
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_2, 0x7FFF);

  // // PB3 Setup
  // SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_3, 0x00FF);

  // // Enable Crossbar1 signals & set properties
  // SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);


  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);

  // PB0 Setup
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0603);
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, 0x1114);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0x0603);

  // PB1 Setup
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_1, 0x03A1);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0xFC1C);

  // Analog Pins (1.14 & 1.15)
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_1, 0xC000);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_1, 0xC000);

#ifndef PCB_V7
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_1, 0x0200 ); //Set 5V regulator off
#endif
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_1, 0x0100 ); //Set USB high power mode

#ifdef PCB_V7
  SI32_PBSTD_A_write_pins_low(SI32_PBSTD_2, 0x03E0 ); //Set external LEDS 0-4 off
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_2, 0x03E0); //Set external LEDS 0-4 as outputs
#endif

  // Enable Crossbar0 signals & set properties
  SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0,
                                         SI32_PBCFG_A_XBAR0H_UART0EN |
                                         SI32_PBCFG_A_XBAR0H_UART1EN);
  SI32_PBCFG_A_enable_xbar0l_peripherals(SI32_PBCFG_0,
                                         SI32_PBCFG_A_XBAR0L_USART0EN |
                                         SI32_PBCFG_A_XBAR0L_SPI0EN |
                                         SI32_PBCFG_A_XBAR0L_SPI0NSSEN |
                                         SI32_PBCFG_A_XBAR0L_USART1EN |
                                         SI32_PBCFG_A_XBAR0L_USART1FCEN |
                                         SI32_PBCFG_A_XBAR0L_I2C0EN);
  SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);

  // PB2 Setup
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_2, 0xFFFF);

  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_2 );

  // PB3 Setup
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_3, 0xFFFF);

  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_3 );


  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_1 );

#ifdef PCB_V7
  //PB3.8 is high voltage dc detection
  //PB3.9 is usb voltage detection
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_3, 0x00000300);
  //PB3.11 5V on/off
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_3, ( u32 ) 1 << 11 ); //Set 5V regulator off
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_3, ( u32 ) 1 << 11);
  // PB2.1 is wakeup
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_2, 0x00000002);
#else
  //PB3.6 is external input 1
  //PB3.7 is high voltage dc detection
  //PB3.8 is usb voltage detection
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_3, 0x000001C0);
  //PB3.11 is RS232 Force Off
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_3, ( u32 ) 1 << 11);
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_3, ( u32 ) 1 << 11 );
  //PB0.10 is RS232 VCC
  SI32_PBSTD_A_set_pins_push_pull_output(SI32_PBSTD_0, ( u32 ) 1 << 10);
  SI32_PBSTD_A_write_pins_high(SI32_PBSTD_0, ( u32 ) 1 << 10 );
#endif

  //PB0.1 is external input 2
  //PB0.0 is accel INT1
  SI32_PBSTD_A_set_pins_digital_input(SI32_PBSTD_0, 0x00000003);
  SI32_PBSTD_A_disable_pullup_resistors( SI32_PBSTD_0 );

  // Enable Crossbar1 signals & set properties
  SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);


  // Setup PBHD4
  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);
  SI32_PBHD_A_write_pblock(SI32_PBHD_4, 0x00);

  SI32_PBHD_A_select_pin0_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin1_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin2_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin3_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin4_safe_state(SI32_PBHD_4, 0x0);
  SI32_PBHD_A_select_pin5_safe_state(SI32_PBHD_4, 0x0);

  SI32_PBHD_A_enable_bias(SI32_PBHD_4);
  SI32_PBHD_A_select_normal_power_port_mode(SI32_PBHD_4);
  SI32_PBHD_A_enable_drivers(SI32_PBHD_4);

  //Setup PB4.0/4.1 to outputs, no pullups, and low for MOSFET outputs
  //Setup PB4.3 LED0/1
  //Setup PB4.4/4.5 GPS
  //Setup PB4.2 to HIGH to turn on mosfets for bat charger!
  SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x003F );
  SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );
  SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );

  SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4, 0x3F);

  //SI32_PBHD_A_select_nchannel_current_limit(SI32_PBHD_4, 0xA);
  SI32_PBHD_A_select_pchannel_current_limit(SI32_PBHD_4, 0xF);
  SI32_PBHD_A_enable_pin_current_limit( SI32_PBHD_4, 0x3F );

  SI32_PBHD_A_select_slew_rate(SI32_PBHD_4, SI32_PBHD_A_SLEW_FASTEST);

#ifdef PCB_V7
#ifdef PCB_V7_CHARGER_NPN
  //PB4.2 charger disconnect needs to be set high to enable NPN
  SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x04 );
#else
  //PB4.2 charger disconnect needs to be set low to enable MOSFET
  SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x04 );
#endif
#endif

#ifdef PCB_V7
  // PB4.4 high to power RS232 and I2C
  SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x10 );
  // PB4.4 high to power RS232 and I2C
  SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x10 );
#endif

  // SI32_PBHD_A_select_pchannel_current_limit(SI32_PBHD_4, 0);
  // SI32_PBHD_A_enable_pin_current_limit( SI32_PBHD_4, 0x3F );

  // SI32_PBHD_A_write_pblock(SI32_PBHD_4, 0x0000);
  // SI32_PBHD_A_enable_drivers(SI32_PBHD_4);
  // SI32_PBHD_A_select_pchannel_current_limit(SI32_PBHD_4, 15);
  // SI32_PBHD_A_select_nchannel_current_limit(SI32_PBHD_4, 15);
  // SI32_PBHD_A_set_pins_push_pull_output(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_set_pins_high_drive_strength(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_enable_n_channel_drivers(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_enable_p_channel_drivers(SI32_PBHD_4, 0x003F);
  // SI32_PBHD_A_enable_pin_current_limit(SI32_PBHD_4, 0x003F);
  //Enable blue LED's if we are on or just in a PM9 temporary sleep...
  if(rram_read_bit(RRAM_BIT_POWEROFF) == POWEROFF_MODE_ACTIVE)
  {
#ifdef PCB_V7
    SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x08 );
#else
  #ifndef USE_EXTERNAL_MOSFETS
      SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x02 );
  #endif
      SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x08 );
#endif
  }
  else 
  {
#ifdef PCB_V7
    SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x08 );
#else
  #ifndef USE_EXTERNAL_MOSFETS
      SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x02 );
  #endif
      SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x08 );
#endif
  }

