darren1713/elua/src/platform/sim3u1xx/platform.c
    d->running = 1;

    if( d->clocked == 1 )
    {
      // not yet implemented
    }
    else
    {
      SI32_SARADC_A_start_conversion( SI32_ADC );
    }
  }
  
  return PLATFORM_OK;
}

#endif // ifdef BUILD_ADC

// ****************************************************************************
// I2C support

#if NUM_I2C > 0

//#define DEBUG_I2C

static SI32_I2C_A_Type* const i2cs[] = { SI32_I2C_0, SI32_I2C_1 };

#define  I2C_WRITE          0x00           // I2C WRITE command
#define  I2C_READ           0x01           // I2C READ command

u32 platform_i2c_setup( unsigned id, u32 speed )
{
  SI32_I2C_A_set_scaler_value( i2cs[ id ], ( cmsis_get_cpu_frequency() / speed ) );

  // set SETUP time to non-zero value for repeated starts to function correctly
  SI32_I2C_A_set_extended_data_setup_time(SI32_I2C_0, 0x01);

  // ENABLE MODULE
  SI32_I2C_A_enable_module( i2cs[ id ] );

  // Return actual speed
  return cmsis_get_cpu_frequency() / SI32_I2C_A_get_scaler_value( i2cs[ id ] );
}

void platform_i2c_send_start( unsigned id )
{
  // The master write operation starts with firmware setting the STA
  // bit to generate a start condition.

  SI32_I2C_A_set_start( i2cs[ id ] );

  if( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
    SI32_I2C_A_clear_tx_interrupt ( i2cs[ id ] );

  if( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) )
    SI32_I2C_A_clear_rx_interrupt ( i2cs[ id ] );

  i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

  while( SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) == 0 &&
         i2c_timeout_timer );

  if( i2c_timeout_timer == 0 )
  {
#if defined( DEBUG_I2C )
    printf("BEG TIMEOUT\n");
#endif
    return;
  }
#if defined( DEBUG_I2C )
  printf("BEG CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif
}

void platform_i2c_send_stop( unsigned id )
{
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("END CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    if( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_tx_interrupt ( i2cs[ id ] );

    if( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_rx_interrupt ( i2cs[ id ] );

    SI32_I2C_A_set_stop( i2cs[ id ] );
#if defined( DEBUG_I2C )
    printf("END CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_stop_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( i2c_timeout_timer == 0 )
      return;

    SI32_I2C_A_clear_stop( i2cs[ id ] );
    SI32_I2C_A_send_nack ( i2cs[ id ] );
    SI32_I2C_A_clear_stop_interrupt( i2cs[ id ] );
#if defined( DEBUG_I2C )
    printf("END CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif
  }
  else
  {
#if defined( DEBUG_I2C )
    printf("send_stop: not active\n");
#endif
  }
}

int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
  u8 acktmp = 0;
  // The ISR or firmware routine should then clear the start bit (STA),
  // set the targeted slave address and the R/W direction bit in the DATA
  // register, set the byte count, arm the transmission (TXARM = 1), and
  // clear the start interrupt.
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("A CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    while( SI32_I2C_A_is_start_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );
    if( i2c_timeout_timer == 0 )
    {
#if defined( DEBUG_I2C )
      printf("I2C TIMEOUT\n");
#endif
      return 0;
    }

    //SI32_I2C_A_set_slave_address_7_bit( i2cs[ id ] );
    SI32_I2C_A_clear_start( i2cs[ id ] );

    SI32_I2C_A_write_data( i2cs[ id ] , ( address << 1 ) | (direction == PLATFORM_I2C_DIRECTION_TRANSMITTER ?  I2C_WRITE : I2C_READ) );
    SI32_I2C_A_set_byte_count( i2cs[ id ] , 1);
    SI32_I2C_A_arm_tx( i2cs[ id ] );

    SI32_I2C_A_clear_tx_interrupt( i2cs[ id ] ); //JEFF TESTING!!
    SI32_I2C_A_clear_ack_interrupt( i2cs[ id ] );
    SI32_I2C_A_clear_start_interrupt( i2cs[ id ] );

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( i2c_timeout_timer == 0 )
    {
#if defined( DEBUG_I2C )
      printf("I2C TIMEOUT2\n");
#endif
      return 0;
    }

    acktmp = ( u8 )SI32_I2C_A_is_ack_received( i2cs[ id ] );

    SI32_I2C_A_clear_ack_interrupt( i2cs[ id ] );

    if( direction == PLATFORM_I2C_DIRECTION_RECEIVER )
    {
      SI32_I2C_A_clear_tx_interrupt( i2cs[ id ] );
    }
#if defined( DEBUG_I2C )
    printf("A CONTROL = %lx %d\n",  i2cs[ id ]->CONTROL.U32, acktmp );
#endif
  }
  else
  {
    //#if defined( DEBUG_I2C )
    printf("send_addr: not active\n");
    //#endif
  }

  return acktmp;
}

int platform_i2c_send_byte( unsigned id, u8 data )
{
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("B CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif
    u32 tmpdata = ( u32 )data;
    SI32_I2C_A_set_byte_count( i2cs[ id ] , 1 );
    SI32_I2C_A_write_data( i2cs[ id ], tmpdata );
    SI32_I2C_A_arm_tx( i2cs[ id ] );
    SI32_I2C_A_clear_tx_interrupt( i2cs[ id ] );

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( i2c_timeout_timer == 0 )
      return 0;

    SI32_I2C_A_clear_ack_interrupt( i2cs[ id ] );

#if defined( DEBUG_I2C )
    printf("B CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif
    if( SI32_I2C_A_is_ack_received(SI32_I2C_0) )
      return 1;
    else
      return 0;
  }
  else
  {
#if defined( DEBUG_I2C )
    printf("send_byte: not active\n");
#endif
    return 0;
  }
}

int platform_i2c_recv_byte( unsigned id, int ack )
{
  u32 tmpdata;
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("R CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

    SI32_I2C_A_set_byte_count( i2cs[ id ] , 1);
    SI32_I2C_A_arm_rx( i2cs[ id ] );

    if( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_rx_interrupt ( i2cs[ id ] );
    else if( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_tx_interrupt ( i2cs[ id ] );

