darren1713/elua/src/platform/sim3u1xx/platform.c
    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_ack_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( i2c_timeout_timer == 0 )
      return 0;

    if( ack )
      SI32_I2C_A_send_ack( i2cs[ id ] );
    else
      SI32_I2C_A_send_nack( i2cs[ id ] );

    SI32_I2C_A_clear_ack_interrupt( i2cs[ id ] );

    i2c_timeout_timer = I2C_TIMEOUT_SYSTICKS;

    while( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) == 0 &&
      i2c_timeout_timer );

    if( i2c_timeout_timer == 0 )
      return 0;

    tmpdata = SI32_I2C_A_read_data( i2cs[ id ] );
#if defined( DEBUG_I2C )
    printf("Got: %u\n",(u8)tmpdata);
    if( 0xFFFFFF00 & tmpdata )
      printf("GOT MORE THAN ONE BYTE!\n");

    printf("R CONTROL = %lx\n",  i2cs[ id ]->CONTROL.U32 );
#endif

      return ( u8 )tmpdata;
  }
  else
  {
#if defined( DEBUG_I2C )
    printf("recv_byte: not active\n");
#endif
    return 0;
  }
}

#endif // NUM_I2C > 0

// ****************************************************************************
// PMU functions

void sim3_pmu_sleep( unsigned seconds )
{
  #ifdef EXTRA_SLEEP_HOOK
    extras_sleep_hook(seconds);
  #endif

  // GET CURRENT TIMER VALUE INTO SETCAP
  SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  // SET ALARM FOR now+s
  // RTC running at 16.384Khz so there are 16384 cycles/sec)
  SI32_RTC_A_write_alarm0(SI32_RTC_0, SI32_RTC_A_read_setcap(SI32_RTC_0) + (16384 * seconds));
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);

  // Enable RTC alarm interrupt
  SI32_RTC_A_enable_alarm0_interrupt(SI32_RTC_0);

  // Disable crossbar peripheral connections
  //SI32_PBCFG_A_write_xbar1(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0h(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0l(SI32_PBCFG_0,0x00000000);

  // Mask low priority interrupts from waking us
  __set_BASEPRI(0x40);

  SI32_DMACTRL_A_disable_module( SI32_DMACTRL_0 );
  SI32_CLKCTRL_A_exit_fast_wake_mode( SI32_CLKCTRL_0 );
  SI32_RSTSRC_A_disable_power_mode_9( SI32_RSTSRC_0 );

  // Switch VREG to low power mode
  SI32_VREG_A_disable_band_gap( SI32_VREG_0 );
  SI32_VREG_A_enter_suspend_mode( SI32_VREG_0 );
  //SI32_VREG_A_enable_vbus_invalid_interrupt( SI32_VREG_0 );

  // Disable VDD Monitor
  SI32_VMON_A_disable_vdd_supply_monitor(SI32_VMON_0);

  // Switch AHB source to LFO oscillator
  SI32_CLKCTRL_A_select_ahb_source_low_frequency_oscillator( SI32_CLKCTRL_0 );

  // Turn off all peripheral clocks
  SI32_CLKCTRL_A_disable_apb_to_all_modules( SI32_CLKCTRL_0 );

  __WFI();

  SI32_CLKCTRL_A_select_ahb_source_low_power_oscillator(SI32_CLKCTRL_0);

  // Allow all interrupts
  __set_BASEPRI(0x00);

  // Re-enable clocks used at startup
  clk_init();
  pios_init();

  SI32_VREG_A_enable_band_gap( SI32_VREG_0 );
  SI32_EXTVREG_A_enable_module( SI32_EXTVREG_0 );
}

void sim3_pmu_reboot( void )
{
  // Stop USB
  SI32_USB_A_reset_module( SI32_USB_0 );
  NVIC_DisableIRQ(USB0_IRQn);
  SI32_USB_A_disable_module(SI32_USB_0);
  SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );

  SI32_RSTSRC_A_generate_software_reset( SI32_RSTSRC_0 );
}

void sim3_pmu_reboot_nodfu( void )
{
  sim3_pmu_pm9(TRICK_TO_REBOOT_WITHOUT_DFU_MODE);
}

void memory_error( void )
{
  sim3_pmu_reboot_nodfu();
}

void myPMU_enter_sleep(void)
{
  // Configure for Sleep
  SI32_PMU_A_clear_wakeup_flags(SI32_PMU_0);
  SI32_RSTSRC_A_enable_power_mode_9(SI32_RSTSRC_0);
  SCB->SCR = SCB_SCR_SLEEPDEEP_Msk; // set SLEEPDEEP
  __set_FAULTMASK(1);
  __WFI();
}
void VREG0_vbus_invalid_handler(void)
{
}
void myPB_enter_off_config()
{
  //SI32_PBSTD_A_write_pins_high(SI32_PBSTD_2, 0xC00);
  /*int i;
  for( i=0; i<4; i++)
  {
    SI32_PBSTD_A_set_pins_digital_input( port_std[ i ], 0xFFFF);
    SI32_PBSTD_A_disable_pullup_resistors( port_std[ i ] );
    SI32_PBSTD_A_write_pins_low( port_std[ i ], 0xFFFF );
  }

   SI32_PBHD_A_disable_bias( SI32_PBHD_4 );
   SI32_PBHD_A_disable_pin_current_limit( SI32_PBHD_4, 0x3F );
   SI32_PBHD_A_set_pins_digital_input( SI32_PBHD_4, 0x3F );
   SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );
   SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );*/


//  SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x00 ); //Disable P channel drivers
//  SI32_PBHD_A_disable_p_channel_drivers( SI32_PBHD_4, 0x3F );
//  SI32_PBHD_A_disable_n_channel_drivers( SI32_PBHD_4, 0x3F );

  // all ports hi-z (analog)
  //SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0000FFFF);
  //SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_1, 0x0000FFFF);
  //SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_2, 0x0000FFFF);
  //SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_3, 0x0000FFFF);

  //PBHD to High impedance
  //SI32_PBHD_A_disable_drivers(SI32_PBHD_4);
  //SI32_PBHD_A_disable_bias(SI32_PBHD_4);

   // all ports hi-z (analog)
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_0, 0x0000FFFF);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_1, 0x0000FFFF);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_2, 0x0000FFFF);
  SI32_PBSTD_A_set_pins_analog(SI32_PBSTD_3, 0x0000FFFF);

  //PBHD to High impedance
  //SI32_PBHD_A_disable_drivers(SI32_PBHD_4);
  //SI32_PBHD_A_disable_bias(SI32_PBHD_4);

  //PBHD to High impedance
  //SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4,0x3F);
  //SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );
  ////SI32_PBHD_A_disable_drivers(SI32_PBHD_4);
  ////SI32_PBHD_A_disable_bias(SI32_PBHD_4);
  SI32_PBCFG_A_unlock_ports(SI32_PBCFG_0);
  SI32_PBHD_A_write_pblock(SI32_PBHD_4, 0x00);

  SI32_PBCFG_A_enable_xbar0h_peripherals(SI32_PBCFG_0, 0x0000);
  SI32_PBCFG_A_enable_xbar0l_peripherals(SI32_PBCFG_0, 0x0000);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_0, 0xFFFF);
  SI32_PBSTD_A_write_pbskipen(SI32_PBSTD_1, 0xFFFF);
  SI32_PBCFG_A_enable_crossbar_0(SI32_PBCFG_0);
  SI32_PBCFG_A_enable_crossbar_1(SI32_PBCFG_0);

  int i;
  for( i=0; i<4; i++)
  {
    SI32_PBSTD_A_set_pins_analog(port_std[ i ], 0x0000);
    SI32_PBSTD_A_write_pbskipen(port_std[ i ], 0xFFFF);
    SI32_PBSTD_A_set_pins_digital_input( port_std[ i ], 0xFFFF);
    SI32_PBSTD_A_disable_pullup_resistors( port_std[ i ] );
    SI32_PBSTD_A_write_pins_low( port_std[ i ], 0xFFFF );
  }

  //JEFF TEST
  //SI32_PBCFG_A_write_xbar1(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0h(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0l(SI32_PBCFG_0,0x00000000);

  //Set I2C pins to analog float...
  SI32_PBSTD_A_set_pins_analog( SI32_PBSTD_0, 0x0000C000);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_0, 0xC000 );
#ifdef BLUETOOTH_POWEREDWHILESLEEPING
  //Set bluetooth pins to analog float...
  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 0x0080);
  SI32_PBSTD_A_write_pins_high( SI32_PBSTD_1, 0x0080 );
#endif
  //Set 5V pin to analog float...
  SI32_PBSTD_A_set_pins_push_pull_output( SI32_PBSTD_1, 0x00000200);
  SI32_PBSTD_A_write_pins_low( SI32_PBSTD_1, 0x0200 );
  
  SI32_PBHD_A_set_pins_push_pull_output( SI32_PBHD_4, 0x00 );
  SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4, 0x3F);
  SI32_PBHD_A_disable_bias( SI32_PBHD_4 );
  SI32_PBHD_A_disable_pin_current_limit( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_set_pins_digital_input( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );
  SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );

#ifdef PCB_V7
#ifdef PCB_V7_CHARGER_NPN
  //PB4.2 is set low above which disables the NPN so do nothing
#else
  //PB4.2 Set the disconnect mosfets to float!
  SI32_PBHD_A_write_pins_high( SI32_PBHD_4, 0x04 );
  SI32_PBHD_A_set_pins_analog( SI32_PBHD_4, 0x04 );
#endif

  //JEFF TESTING with R21 shorted and 150uA to VCC
  SI32_PBSTD_A_write_pins_high( SI32_PBSTD_3, 0x0800 );
  SI32_PBSTD_A_set_pins_digital_input( SI32_PBSTD_3, 0x00000800);
#endif
}



void sim3_pmu_pm9( unsigned seconds )
{
  //u8 i;

  if(seconds != TRICK_TO_REBOOT_WITHOUT_DFU_MODE && external_power() && rram_read_bit(RRAM_BIT_SLEEP_WHEN_POWERED) == SLEEP_WHEN_POWERED_DISABLED)
  {
    printf("Unit is powered, no PM9\n");
    wake_reason = WAKE_POWERCONNECTED;
    rram_write_int(RRAM_INT_SLEEPTIME, seconds);
    return;
  }
  if(seconds == TRICK_TO_REBOOT_WITHOUT_DFU_MODE)
    seconds = 1;

