darren1713/elua/src/platform/sim3u1xx/platform.c
  // Turn off all peripheral clocks
  //--SI32_CLKCTRL_A_disable_apb_to_all_modules( SI32_CLKCTRL_0 );

  //PROBLEM: If this is enabled, the PMU STATUS register does not indicate wake from PM9...
//  SI32_CLKCTRL_A_select_ahb_source_low_frequency_oscillator( SI32_CLKCTRL_0 );

  // SET DEEPSLEEP in SCR (and service all pending interrutps before sleep
  //--SCB->SCR = 0x14;

  // Switch AHB source to RTC oscillator

  //--__WFI();

  // We should never actually get here...

  //--SI32_PMU_A_clear_pmu_level_shifter_hold(SI32_PMU_0);
  //--SI32_PMU_A_clear_pin_level_shifter_hold(SI32_PMU_0);

  //--SI32_CLKCTRL_A_select_ahb_source_low_power_oscillator(SI32_CLKCTRL_0);

  // Allow all interrupts
  //--__set_BASEPRI(0x00);

  // Re-enable clocks used at startup
  //--clk_init();

  //--SI32_VREG_A_enable_band_gap( SI32_VREG_0 );
  //--SI32_EXTVREG_A_enable_module( SI32_EXTVREG_0 );
}

// ****************************************************************************
// PBHD functions

//  SI32_PBHD_A_select_low_power_port_mode(SI32_PBHD_4);  //needs to be high power if VDDHD >3.6v
//  SI32_PBHD_A_select_slew_rate(SI32_PBHD_4, SI32_PBHD_A_SLEW_FASTEST);
//  SI32_PBHD_A_set_pins_low_drive_strength(SI32_PBHD_4, 0x3F);
//  SI32_PBHD_A_enable_drivers(SI32_PBHD_4);

void sim3_pbhd_setbias( unsigned state )
{
  //  SI32_PBHD_A_enable_bias(SI32_PBHD_4)
}

void sim3_pbhd_setdrive( unsigned state )
{

}

void sim3_pbhd_setslew( unsigned state )
{

}

void sim3_pbhd_setdrivestrength( unsigned state, int pin )
{

}

// ****************************************************************************
// Flash access functions

volatile u8 flash_key_mask  = 0x00;
volatile u8 armed_flash_key = 0x00;

u8 flash_erase( u32 address, u8 verify)
{
    u32 wc;
    u32* verify_address;
    // Write the address of the Flash page to WRADDR
    SI32_FLASHCTRL_A_write_wraddr( SI32_FLASHCTRL_0, address );
    // Enter Flash Erase Mode
    SI32_FLASHCTRL_A_enter_flash_erase_mode( SI32_FLASHCTRL_0 );

    // Disable interrupts
    //hw_intp_disable();

    // Unlock the flash interface for a single access
    armed_flash_key = flash_key_mask ^ 0xA4;
    SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, armed_flash_key);
    armed_flash_key = flash_key_mask ^ 0xF0;
    SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, armed_flash_key);
    armed_flash_key = 0;

    // Write any value to initiate a page erase.
    SI32_FLASHCTRL_A_write_wrdata(SI32_FLASHCTRL_0, 0xA5);

    // Wait for flash operation to complete
    while (SI32_FLASHCTRL_A_is_flash_busy(SI32_FLASHCTRL_0));

    if( verify )
    {

        address &= ~(INTERNAL_FLASH_SECTOR_SIZE - 1); // Round down to nearest even page address
        verify_address = (u32*)address;

        for( wc = INTERNAL_FLASH_SECTOR_SIZE/4; wc != 0; wc-- )
        {
            if ( *verify_address != 0xFFFFFFFF )
                return 1;

            verify_address++;
        }
    }

    //hw_intp_enable();

    return 0;
}


u8 flash_write( u32 address, u32* data, u32 count, u8 verify )
{
    u32* tmpdata = data;
    u32* verify_address;
    u32 wc;

    // Write the address of the Flash page to WRADDR
    SI32_FLASHCTRL_A_write_wraddr( SI32_FLASHCTRL_0, address );
    // Enter flash erase mode
    SI32_FLASHCTRL_A_exit_flash_erase_mode(SI32_FLASHCTRL_0);

    // disable interrupts
    //hw_intp_disable();

    // Unlock flash interface for multiple accesses
    armed_flash_key = flash_key_mask ^ 0xA4;
    SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, armed_flash_key);
    armed_flash_key = flash_key_mask ^ 0xF3;
    SI32_FLASHCTRL_A_write_flash_key(SI32_FLASHCTRL_0, armed_flash_key);
    armed_flash_key = 0;

    // Write word-sized
    for( wc = count; wc != 0; wc-- )
    {
        SI32_FLASHCTRL_A_write_wrdata( SI32_FLASHCTRL_0, *data );
        SI32_FLASHCTRL_A_write_wrdata( SI32_FLASHCTRL_0, *data >> 16 );
        data++;
    }

    // Relock flash interface
    SI32_FLASHCTRL_A_write_flash_key( SI32_FLASHCTRL_0, 0x5A );

    // Wait for flash operation to complete
    while( SI32_FLASHCTRL_A_is_flash_busy(SI32_FLASHCTRL_0 ) );

    if( verify )
    {
        verify_address = (u32*)address;

        for( wc = count; wc != 0; wc-- )
        {
            if (*verify_address != *tmpdata++)
            {
                return 1;
            }

            verify_address++;
        }
    }

    // re-enable interrupts
    //hw_intp_enable();

    return 0;
}


u32 platform_s_flash_write( const void *from, u32 toaddr, u32 size )
{
  flash_key_mask = 0x01;
  return flash_write( toaddr, ( u32 * )from, (size + (4 - 1))/4, 1 );
}

int platform_flash_erase_sector( u32 sector_id )
{
  flash_key_mask = 0x01;
  return flash_erase( sector_id * INTERNAL_FLASH_SECTOR_SIZE + INTERNAL_FLASH_START_ADDRESS, 1) == 0 ? PLATFORM_OK : PLATFORM_ERR;
}

// ****************************************************************************
// USB functions

#if defined( BUILD_USB_CDC )

unsigned platform_get_console_uart( void )
{
  return CON_UART_ID;
}

void platform_usb_cdc_send( u8 data )
{
  usb_pcb_t *pcb = usb_pcb_get();

  if (!(pcb->flags & (1<<ENUMERATED)))
  {
      return;
  }
  if(usb_buf_space(EP_1) == 0)
      return;
    
  if(usb_buf_write(EP_1, (U8)data) == 0)
    usb_poll();//ep_write(EP_1);
}

int platform_usb_cdc_recv( s32 timeout )
{
  usb_pcb_t *pcb = usb_pcb_get();

  if (!(pcb->flags & (1<<ENUMERATED)))
      return -1;

  if(/*usb_buf_bytes(EP_3)*/pcb->fifo[EP_3].len > 0 )
    return usb_buf_read(EP_3);
  else
    return -1;
}

#endif




// ****************************************************************************
// Platform specific modules go here
// #ifdef PS_LIB_TABLE_NAME


// #define MIN_OPT_LEVEL 2
// #include "lrodefs.h"
// #ifdef ENABLE_PMU
// extern const LUA_REG_TYPE pmu_map[];
// #endif

// // #if defined( EXTRA_LIBS_INCLUDE )
// // #include "extra_libs.h"
// // #endif

// // #if defined( SIM3_EXTRA_LIBS_ROM ) && LUA_OPTIMIZE_MEMORY == 2
// // #define _EXTRAROM( name, openf, table ) extern const LUA_REG_TYPE table[];
// // SIM3_EXTRA_LIBS_ROM;
// // #endif

// const LUA_REG_TYPE platform_map[] =
// {
// //#if LUA_OPTIMIZE_MEMORY > 0
//   //{ LSTRKEY( "pmu" ), LROVAL( pmu_map ) },
// // #if defined(SIM3_EXTRA_LIBS_ROM)
// // #undef _EXTRAROM
// // #define _EXTRAROM( name, openf, table ) { LSTRKEY( #name ), LROVAL( table ) },
// //   SIM3_EXTRA_LIBS_ROM
// // #endif
// // #endif
//   { LNILKEY, LNILVAL }
// };

