darren1713/elua/src/platform/sim3u1xx/platform.c
// LUALIB_API int luaopen_platform( lua_State *L )
// {
// #if LUA_OPTIMIZE_MEMORY > 0
//   return 0;
// #else // #if LUA_OPTIMIZE_MEMORY > 0
//   //Turn on aggressive emergency garbage collection
//   legc_set_mode( L, EGC_ALWAYS, 20);

//   luaL_register( L, PS_LIB_TABLE_NAME, platform_map );

//   // Setup the new tables inside platform table
//   // lua_newtable( L );
//   // luaL_register( L, NULL, pmu_map );
//   // lua_setfield( L, -2, "pmu" );

// #if defined( SIM3_EXTRA_LIBS_ROM )
// #undef _EXTRAROM
/* #define _EXTRAROM( name, openf, table ) \
//   lua_newtable( L ); \
//   luaL_register( L, NULL, table ); \
//   lua_setfield( L, -2, #name ); */
// #endif

//   return 1;
// #endif // #if LUA_OPTIMIZE_MEMORY > 0
// }

// #else // #ifdef ENABLE_PMU

// LUALIB_API int luaopen_platform( lua_State *L )
// {
//   return 0;
// }

// Some extra Lua functions...need to find a home in a better place...

/*
int load_lua_string (const char *s) {
  lua_State *L = lua_getstate();

  if(L == NULL)
    return 0;

  if (luaL_loadstring(L, s) || lua_pcall(L, 0, 0, 0))
    return 0;

  return 1;
}

int load_lua_file (char *filename) {
  lua_State *L = lua_getstate();

  if(L == NULL)
    return 0;

  if (luaL_loadfile(L, filename) || lua_pcall(L, 0, 0, 0))
    return 0;

  return 1;
}

int load_lua_function (char *func) {
  lua_State *L = lua_getstate();

  if(L == NULL)
    return 0;

  lua_getglobal( L, func );

  if (! LUA_ISCALLABLE(L, -1))
  {
    printf("No function %s\n", func);
    return 0;
  }

//  if (lua_pcall(L, 0, 0, 0))
  lua_call(L, 0, 0);
  //  return 0;
  lua_settop ( L, 0 );
  return 1;
}*/

// #endif // #ifdef ENABLE_PMU
